// Метод push - добавляет элемент в конец массива
// let arr = ['Ваня', 'Иштван', 'Оля',];
// arr.push('Вася');


// Метод shift - удаляет элемент в начале,
// так что второй элемент становится первым.
/*
let arr = ['Ваня', 'Иштван', 'Оля',];
arr.shift();
console.log(arr);
*/


// Метод pop  - удаляет последний элемент
/*
let arr = ['Ваня', 'Иштван', 'Оля',];
arr.pop();
console.log(arr);
*/


// Метод unshift  - добавляет элемент в начало массива
/*
let arr = ['Ваня', 'Иштван', 'Оля',];
arr.unshift('Вася');
console.log(arr);

arr.unshift('Дима', 'Катя');
console.log(arr);
*/

// for length
/*
let arr = ['Ваня', 'Иштван', 'Оля',];
console.log(arr.length);

// Цикл FOR
for (let i = 0; i < arr.length; i++) {
	console.log(arr[i]);
}
*/
// Длина массива равняется 3, поэтому итерация закончится на 2
// но i установлено на 0 и вывод имен закончится на 2 индесе
// так как по условию i должно быть менньше lenght массива
